M-Blocks/MBlocks-MB/nRF51_SDK_v4.4.0.31803/Nordic/nrf51822/Board/nrf6310/ble_s110_serialization/ble_app_hrs/main.c
#define DEAD_BEEF                            0xDEADBEEF                                     /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define CONN_CHIP_RESET_PIN_NO              30                                              /**< Pin used for reseting the connectivity chip. */
#define CONN_CHIP_RESET_TIME                50                                              /**< The time to keep the reset line to the connectivity chip low (in milliseconds). */
#define CONN_CHIP_WAKEUP_TIME               500                                             /**< The time for connectivity chip to reset and become ready to receive serialized commands (in milliseconds). */

#define SCHED_MAX_EVENT_DATA_SIZE           MAX(APP_TIMER_SCHED_EVT_SIZE,\
                                                BLE_STACK_HANDLER_SCHED_EVT_SIZE)           /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE                    30                                              /**< Maximum number of events in the scheduler queue. */

static uint16_t                              m_conn_handle = BLE_CONN_HANDLE_INVALID;       /**< Handle of the current connection. */
static ble_gap_sec_params_t                  m_sec_params;                                  /**< Security requirements for this application. */
static ble_gap_adv_params_t                  m_adv_params;                                  /**< Parameters to be passed to the stack when starting advertising. */
static ble_bas_t                             m_bas;                                         /**< Structure used to identify the battery service. */
static ble_hrs_t                             m_hrs;                                         /**< Structure used to identify the heart rate service. */
static bool                                  m_rr_interval_enabled = true;                  /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static ble_sensorsim_cfg_t                   m_battery_sim_cfg;                             /**< Battery Level sensor simulator configuration. */
static ble_sensorsim_state_t                 m_battery_sim_state;                           /**< Battery Level sensor simulator state. */
static ble_sensorsim_cfg_t                   m_heart_rate_sim_cfg;                          /**< Heart Rate sensor simulator configuration. */
static ble_sensorsim_state_t                 m_heart_rate_sim_state;                        /**< Heart Rate sensor simulator state. */
static ble_sensorsim_cfg_t                   m_rr_interval_sim_cfg;                         /**< RR Interval sensor simulator configuration. */
static ble_sensorsim_state_t                 m_rr_interval_sim_state;                       /**< RR Interval sensor simulator state. */

static app_timer_id_t                        m_battery_timer_id;                            /**< Battery timer. */
static app_timer_id_t                        m_heart_rate_timer_id;                         /**< Heart rate measurement timer. */
static app_timer_id_t                        m_rr_interval_timer_id;                        /**< RR interval timer. */
static app_timer_id_t                        m_sensor_contact_timer_id;                     /**< Sensor contact detected timer. */

extern void                                  hci_transport_timeout_handle(void * p_context);/**< Declaration of HCI Transport timeout handler. This timeout handler must be handled in APP-LO to ensure correct behavior accrording to @ref nrf51_system_integration_serialization. */

/**@brief Function for error handling, which is called when an error has occurred. 
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name. 
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    nrf_gpio_pin_set(ASSERT_LED_PIN_NO);

    // This call can be used for debug purposes during development of an application.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    //ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    for (;;) ;
    //    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;
    
    battery_level = (uint8_t)ble_sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);
    
    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if (
        (err_code != NRF_SUCCESS)
        &&
        (err_code != NRF_ERROR_INVALID_STATE)
        &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS)
        &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


